multiSpeciesMassTransportLibrary/testCase/reactingFoam_convection/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-6;
        relTol           0.1;
    }

    pFinal
    {
        $p;
        tolerance        1e-6;
        relTol           0.0;
    }

    "(U|h|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
    }

    "(U|h|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }

    Yi
    {
        $hFinal;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  20;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;

    outerCorrectorResidualControl
    {
        H2O
	{
	    tolerance   1e-5;
	    relTol      0.0;
	}
	h
	{
	    tolerance   1e-5;
	    relTol      0.0;
        }
	p
	{
	    tolerance   1e-5;
	    relTol      0.0;
	}
	"U.*"
	{
	    tolerance   1e-4;
	    relTol      0.0;
	}
    }
}

relaxationFactors
{
    fields
    {
        p               0.7;
	pFinal          1.0;
        p_rgh           0.7;
	p_rghFinal      1.0;
    }
    equations
    {
        "U."            0.7;
	U               0.7;
	"U.*Final"      1.0;
        h               1.0;
	H2O             1.0;
	hFinal          1.0;
	H2OFinal        1.0;
    }
}

// ************************************************************************* //
